package Multitrading;

public class volatile_and_synchronized {
    /*
    Volatile -  Volatile - используется для пометки переменной как хранящейся только
     в основной памяти Main Memory(куча) !!! ИСПОЛЬЗУЕТСЯ ТОЛЬКО ТОГДА КОГДА ТОЛЬКО ОДИН
     ПОТОК МОЖЕТ ИЗМЕНЯТЬ ЗНАЧЕНИЕ ПЕРМЕННОЙ А ОСТАЛЬНЫЕ ПОТОКИ МОГУТ ЕЕ ТОЛЬКО ЧИТАТЬ!!! .
     Переменная volatile является атомарной для чтения,
     но операции над переменной НЕ являются атомарными.

    Synchronized - создает взаимное исключение(mutual exclusion - только
    один поток может выполнять synchronized блок/метод для данного объекта
    в один момент времени) и полную синхронизацию памяти.
     */
}
