package Multitrading;

public class Монитор {
    /*
    1/Монитор — это механизм синхронизации в многопоточных системах,
    который управляет одновременным доступом нескольких потоков к общему ресурсу (объекту)
    2/ Он гарантирует, что в каждый момент времени только один поток может выполнять
    критическую секцию кода (работать с ресурсом), а остальные потоки вынуждены ждать
    освобождения монитора.
    3/ В Java монитор встроен в каждый объект и управляется через ключевое слово synchronized.
    
    Если повесить синхронайз на статический метод монитором является сам класс

     */

}
