package Patterns.Spring_Patterns.Поведенческие;

public class Strategy {
    /*
    Паттерн Стратегия предлагает определить семейство схожих алгоритмов,
    которые часто изменяются или расширяются, и вынести их в собственные классы,
    называемые стратегиями.

    Вместо того, чтобы изначальный класс сам выполнял тот или иной алгоритм,
    он будет играть роль контекста, ссылаясь на одну из стратегий и делегируя ей
    выполнение работы. Чтобы сменить алгоритм, вам будет достаточно подставить в
    контекст другой объект-стратегию.
     */
}
