package Разное;

public class Big_O {
    /*
    Big O — это математическая нотация, описывающая асимптотическую сложность алгоритма,
    то есть как время выполнения или потребление памяти растёт при увеличении размера входных
    данных.

    Основные виды сложности (от лучшей к худшей)
    Сложность	            Название                        Пример в Java
    O(1)	    Константная	Доступ по индексу массива           arr[i]
    O(log n)	Логарифмическая	Бинарный поиск          в отсортированном массиве
    O(n)	            Линейная	                      Простой цикл по массиву
    O(n log n)	    Линейно-логарифмическая	       Быстрая сортировка, сортировка слиянием
    O(n²)	            Квадратичная	            Вложенные циклы, пузырьковая сортировка
    O(2ⁿ)	        Экспоненциальная	    Рекурсивное вычисление чисел Фибоначчи (без мемоизации)
    O(n!)	            Факториальная	                     Перебор всех перестановок
     */
}
