package Разное;

public class docker_dockerCompose {
    /*
    Docker - эт платформа для запуска приложений в контейнерах.(Создает и запускает контейнеры)

    Docker compose - Это инструмент для определения и запуска многоконтейнерных приложений.
    Вы описываете всю конфигурацию вашего проекта в файле (docker-compose.yml),
    а Docker Compose уже "общается" с Docker, чтобы развернуть всё это хозяйство одной командой.

    Dockerfile - это инструкция по сборке одного Docker-образа. Описывает, как создать контейнер.

    Docker Compose - это инструмент для запуска и управления несколькими контейнерами как единым
    приложением. Описывает, как запустить сервисы.
     */
}
