package Разное;

public class Процесс_и_его_ресурсы {
    /*
    Процесс в операционной системе — это программа, которая находится в состоянии выполнения.
    Это один из фундаментальных concepts в современных ОС (Windows, Linux, macOS, Android и др.).

    Чтобы программа работала, ОС выделяет процессу набор ресурсов:

    Код и данные: Сама программа в памяти.
    Счетчик команд (Program Counter): Адрес текущей выполняемой инструкции. Процессор знает, какую строчку кода выполнять следующей.
    Стек (Stack): Содержит временные данные (локальные переменные, адреса возврата из функций).
    Куча (Heap): Область для динамического выделения памяти (то, что создается во время работы).
    Регистры процессора: Промежуточные значения вычислений.
    Дескрипторы (handles): Ссылки на открытые файлы, сокеты, устройства ввода-вывода.




  */
}
