package Patterns.Spring_Patterns.Структурные;

public class Adapter {
    /*
    Структурный паттерн проектирования, который позволяет объектам с несовместимыми интерфейсами
    работать вместе.
    Это объект-переводчик, который трансформирует интерфейс или данные одного объекта в такой вид,
    чтобы он стал понятен другому объекту.
    При этом адаптер оборачивает один из объектов, так что другой объект даже не знает о наличии
    первого.

    +: Отделяет и скрывает от клиента подробности преобразования различных интерфейсов.
    - : Усложняет код программы из-за введения дополнительных классов.
     */
}
