package Core;

public class OOП {
    /*
    Объектно-ориентированное программирование (ООП) — это подход к написанию кода, при котором
    программа строится из объектов, каждый обьект является экземпляром класса,
    и они формируют иерархию наследования.

    ИНКАПСУЛЯЦИЯ
    Свойство системы, которое объединяет данные и методы, манипулирующие этими данными,
    а также защищает и то, и другое от внешнего вмешательства или неправильного использования.

    Инкапсуляция - это объединение данных и методов работы с этими данными в одной упаковке
    («капсуле»).
    Чтобы малейшее изменение в классе не влекло за собой изменение внешнего поведения класса.

    НАСЛЕДОВАНИЕ
    Свойство системы, которое позволяет описать новый класс на основе уже существующего с
    частично или полностью заимствованной функциональностью

    ПОЛИМОРФИЗМ
    Полиморфизм – предоставляет возможность единообразно обрабатывать объекты с различной
    реализацией при условии наличия у них общего интерфейса или класса.
    Полиморфизм – способность функции обрабатывать данные разных типов.

    Есть три вида полиморфизма:
    -ad hoc полиморфизм, основан на различении типов. Для различных типов аргументов
        используется разный код метода, пример статического - перегрузка метода.
        Пример динамического - перегрузка метода. (@Overload)
    -параметрический полиморфизм - ситуация, когда один и тот же метод работает с аргументами
        различных типов одинаково, не зависимо от их точного типа. Пример — функция, работающая
        с объектом некоторого класса C, может без изменений работать с объектом порождённого от
        C класса (этот вид полиморфизма часто называют полиморфизм включения). (@Override)
    -subtype полиморфизм - самый популярный - возможность объектов с одинаковой спецификацией
        (интерфейс\класс\abstract класс) иметь различную реализацию.

    Пример:
    Переопределение методов, интерфейсы.

    АБСТРАКЦИЯ —  означает выделение значимой информации и исключение из рассмотрения незначимой.
    С точки зрения программирования это правильное разделение программы на объекты.
    Абстракция позволяет отобрать главные характеристики и опустить второстепенные.
     */
}
